app/controllers/user_controller.rb

INSERT INTO `users` (`username`, `mobile`, `address`, `email`, `created_at`, `updated_at`) VALUES ('viki', 345, 'rerjn', 'vikiesakki@gmail.com', '2017-06-09 08:39:13', '2017-06-09 08:39:13')
---
  def create
    @users = User.new(allowed_params)
    if @users.save